-- Заполнение таблиц базы данных Polyclinic

-- таблица персональных данных
insert into persons
    (id, surname, [name], patronymic)
values
    (1,  'Юрковский',   'Марк',      'Максимилианович'), /*  1 */
	(2,  'Якубовская',  'Диана',     'Павловна'),		/*  2 */
    (3,  'Шапиро',      'Федор',     'Федорович'),     	/*  3 */
	(4,  'Вожжаев',     'Сергей',    'Денисович'),     	/*  4 */
    (5,  'Хроменко',    'Игорь',     'Владимирович'),  	/*  5 */
	(6,  'Пелых',       'Марина',    'Ульяновна'),     	/*  6 */
	(7,  'Лапотникова', 'Тамара',    'Оскаровна'),     	/*  7 */
	(8,  'Огородников', 'Сергей',    'Иванович'),      	/*  8 */
    (9,  'Яйло',        'Екатерина', 'Николаевна'),    	/*  9 */
	(10, 'Лосева',      'Инна',      'Степановна'),    	/* 10 */
    (11, 'Михайлович',  'Анна',      'Валентиновна'),  	/* 11 */
	(12, 'Тарапата',    'Михаил',    'Исаакович'),     	/* 12 */
	(13, 'Трубихин',    'Эдуард',    'Михайлович'),    	/* 13 */
	(14, 'Чмыхало',     'Олег',      'Тарасович'),     	/* 14 */
	(15, 'Князьков',    'Степан',    'Сидорович'),     	/* 15 */
	(16, 'Потемкина',   'Наталья',   'Павловна'),      	/* 16 */
    (17, 'Гритченко',   'Степан',    'Романович'),     	/* 17 */
	(18, 'Селиванов',   'Александр', 'Михайлович'),    	/* 18 */
	(19, 'Царькова',    'Лариса',    'Ильинична'),     	/* 19 */
	(20, 'Яструб',      'Владимир',  'Данилович'),     	/* 20 */
    (21, 'Мелашенко',   'Александр', 'Алексеевич'),    	/* 21 */
	(22, 'Пономаренко', 'Владислов', 'Дмитриевич'),    	/* 22 */ 
	(23, 'Хавалджи',    'Любовь',    'Амировна'),      	/* 23 */
	(24, 'Пархоменко',  'Ирина',     'Владимировна'),  	/* 24 */
    (25, 'Демидова',    'Алина',     'Александровна'), 	/* 25 */
	(26, 'Лысенко',     'Елена',     'Егоровна'),      	/* 26 */
	(27, 'Федосенко',   'Оксана',    'Владимировна'),  	/* 27 */
	(28, 'Богатырева',  'Екатерина', 'Алексеевна'),		/* 28 */
	(29, 'Иванова',     'Валентина', 'Степановна'),		/* 29 */
	(30, 'Ильюшин',     'Сергей',    'Юрьевич');		    /* 30 */

-- данные справочника врачебных специальностей
insert into specialities
    (id, [name])
values
    (1,  'терапевт'),      /*  1 */    
	(2,  'стоматолог'),  	/*  2 */
	(3,  'окулист'),     	/*  3 */
	(4,  'кардиолог'),   	/*  4 */
	(5,  'пульманолог'), 	/*  5 */
	(6,  'хирург'),      	/*  6 */
	(7,  'акушер'),      	/*  7 */
	(8,  'отоларинголог'), /*  8 */     
	(9,  'инфекционист'),  /*  9 */    
	(10, 'физиотерпевт'),  /* 10 */    
	(11, 'онколог'),      	/* 11 */
	(12, 'венеролог'),     /* 12 */ 
	(13, 'уролог');      	/* 13 */


-- данные таблицы докторов
insert into doctors
    (id, id_person, id_speciality, price, [percent])
values
    (1,  1, 1,  110, 5.0),  /*  1 */
	(2,  2, 2,  600, 3.0),	 /*  2 */
    (3,  3, 1,  160, 3.5),	 /*  3 */
	(4,  4, 3,  250, 3.2),	 /*  4 */
    (5,  5, 3,  300, 4.5),	 /*  5 */
	(6,  6, 2,  600, 4.5),	 /*  6 */
	(7,  7, 4,  300, 4.0),	 /*  7 */
	(8,  8, 5,  250, 3.5),	 /*  8 */
    (9,  9, 6,  800, 5.1),	 /*  9 */
	(10, 10, 6, 1300, 4.5),	 /* 10 */
    (11, 11, 2,  350, 3.1),	 /* 11 */
	(12, 12, 1,  120, 6.2);	 /* 12 */

-- данные таблицы пациентов
insert into patients  
    (id, id_person, born_date, [address], passport)
values                                                    
    (1,  13, '2001-12-02', 'ул. Садовая, д. 123, кв. 12',			'ЕС45718'),		/*  1 */
	(2,  14, '1991-09-07', 'ул. Зайцева, д. 2',					'АВ34524'),		/*  2 */
	(3,  15, '1963-18-03', 'пр. Титова, д. 11, кв. 91',			'АТ65423'),		/*  3 */
	(4,  16, '1957-21-04', 'ул. Содовая, д. 9',					'ВО12312'),		/*  4 */
    (5,  17, '2001-12-02', 'ул. Челюскинцев, д. 112, кв. 211',		'СК67443'),		/*  5 */
	(6,  18, '1935-01-06', 'пр. Титова, д. 9, кв. 21',				'ВА12234'),		/*  6 */
	(7,  19, '1992-06-07', 'пл. Конституции, д. 3, кв. 75',		'СО54334'),		/*  7 */
	(8,  20, '1991-09-07', 'пр. Мира, д. 3, кв. 64',				'ВС89532'),		/*  8 */
    (9,  21, '1947-23-12', 'ул. Содовая, д. 9, кв. 6',				'СС34267'),		/*  9 */
	(10, 22, '1991-09-07', 'ул. Садовая, д. 10',					'АТ23414'),		/* 10 */
	(11, 23, '1956-29-09', 'ул. Судовая, д. 1, кв. 91',			'СО98751'),		/* 11 */
	(12, 24, '1963-13-04', 'пр. Титова, д. 31, кв. 42',			'ВА32456'),		/* 12 */
    (13, 25, '1957-21-04', 'ул. Челюскинцев, д. 3',				'ВО98412'),		/* 13 */
	(14, 26, '2001-12-02', 'пр. Содовая, д. 13',					'АТ15321'),		/* 14 */
	(15, 27, '2001-04-11', 'пл. Конституции, д. 1, кв. 50',		'СС75198'),		/* 15 */
	(16, 28, '2001-09-10', 'ул. Щорса, д. 23, кв. 17',				'ЕС98415'),		/* 16 */
	(17, 29, '1998-21-12', 'ул. Овнатаняна, д. 4, кв. 98',			'АВ51591'),		/* 17 */
	(18, 30, '1997-27-02', 'ул. Чкалова, д. 11',					'АТ57484');		/* 18 */


-- данные таблицы врачебных приемов 
insert into appointments
    (id, appointment_date, id_patient, id_doctor)
values
    (1,  '2022-10-21',  1,  1),   /*  1 */
    (2,  '2022-10-24',  2,  1),	/*  2 */
    (3,  '2022-10-26',  3,  2),	/*  3 */
    (4,  '2022-10-28',  4,  3),	/*  4 */
    (5,  '2022-10-22',  4,  5),	/*  5 */
    (6,  '2022-10-11',  3,  5),	/*  6 */
    (7,  '2022-12-22',  2,  6),	/*  7 */
    (8,  '2022-10-13',  5,  2),	/*  8 */
    (9,  '2022-10-23',  6,  5),	/*  9 */
    (10, '2022-10-15',  9,  6),	/* 10 */
    (11, '2022-12-22',  7,  6),	/* 11 */
    (12, '2022-10-28',  3,  7),	/* 12 */
    (13, '2022-10-23',  2,  8),	/* 13 */
    (14, '2022-10-28',  4,  9),	/* 14 */
    (15, '2022-11-02',  6,  9);	/* 15 */
