package org.itstep.pd011;

/**
 *
 * Пример перечисления - коды для фруктов в каком-либо приложении
 *
 Ограничения для перечислений
 1. нельзя использовать new при создании перечисления
 2. нельзя наследовать от перечисления - перечисление не м.б. суперклассом
 3. перечисление не м.б. подклассом
 4. перечисление не м.б. абстрактным

 Что м.б. в перечислении
 1. Методы
 2. Конструкторы и поля
 */

public enum Fruits {
    // 0       1      2      3       4       5      6
    NONE, ORANGE, APPLE, LEMON, BANANA, CHERRY, GRAPE
} // enum Fruits

